---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotElevationLostEdgeReferences
source: html/87b87625-91d5-4e99-a4a3-58357bf8b0a7.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DimensionFailures.SpotElevationLostEdgeReferences Property

Some Spot Dimensions lost their References. Those Spot Dimensions will be deleted.

## Syntax (C#)
```csharp
public static FailureDefinitionId SpotElevationLostEdgeReferences { get; }
```